In [20]:
import pandas as pd
df = pd.read_csv("employee.csv")
df.head(2)

   ID FirstName  LastName Gender   Salary Location
0   1       Ben   Hoskins   Male  70000.0    Delhi
1   2      Mark  Hastings   Male  60000.0   Mumbai

### df.set_index('column_name', inplace=True)
##### Makes a column the “main label” for your table rows.

In [21]:
df['ID'].to_list()

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [ ]:
df.set_index('ID',inplace=True)

In [33]:
df.head(2)

   FirstName  LastName Gender   Salary Location
ID
1        Ben   Hoskins   Male  70000.0    Delhi
2       Mark  Hastings   Male  60000.0   Mumbai

In [ ]:
df.head(2).reset_index()
# Brings back the normal counting index.

   index  ID FirstName  LastName Gender   Salary Location
0      0   1       Ben   Hoskins   Male  70000.0    Delhi
1      1   2      Mark  Hastings   Male  60000.0   Mumbai

In [38]:
df.head(2).reset_index().reset_index()

   index  ID FirstName  LastName Gender   Salary Location
0      0   1       Ben   Hoskins   Male  70000.0    Delhi
1      1   2      Mark  Hastings   Male  60000.0   Mumbai

In [39]:
df.head(2).reset_index().reset_index(drop=True)

   ID FirstName  LastName Gender   Salary Location
0   1       Ben   Hoskins   Male  70000.0    Delhi
1   2      Mark  Hastings   Male  60000.0   Mumbai